Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 没有谁会喜欢听别人说自家服装不好的话。
en_us: No one would like to hear that anyone criticize the clothes that they sold.

source: 没有那个女的愿意被一个男的这么称呼。
en_us: No girl would want to be called so by someone of the opposite gender.

source: 没错，都是他们的逼迫，险些害死了唯一的宝贝妹妹。
en_us: Indeed, they almost caused the death of their precious sister because they kept forcing her.

source: 洗完澡的叶漓走出浴室，下意识拿起手机一看，却发现整个弹幕都被消息塞满了。
en_us: After taking a shower, Ye Li walked out of the bathroom and subconsciously picked up her mobile phone to take a look, only to realize that her screen was flooded with pop-up notifications.

source: 洗手间的方向，响起了女生惨叫的声音。
en_us: The sounds of the girl shrieking could be heard coming from the bathroom.

source: 淑女被人欺负了，也会变成恶女的好吗？
en_us: Even a demure lady would become an evil woman after being bullied, okay?

source: 温雅掩藏了眼底的不甘心，朝着叶漓伸出了手。
en_us: Hiding the disgruntlement in her eyes, Wen Ya extended her hand towards Ye Li.

source: 温雅本来是故意挑衅叶漓的。
en_us: Wen Ya initially wanted to deliberately provoke Ye Li.

source: 温雅的笑容都快维持不下去了。
en_us: Wen Ya almost couldn't smile any longer.

source: 温雅眼中的爱慕她一眼就看出来了。
en_us: She could immediately see the adoration in Wen Ya's eyes.

source: 温雅脸上的笑容彻底消失了个干净。
en_us: Wen Ya's smile disappeared completely.

source: 温雅闻言，眼中闪过一抹失望，不过她很快就振作了起来，笑道：“没关系的，我听说现在凤年你有未婚妻了，想必就是这位小姐吧？”她看向叶漓说道。
en_us: Upon hearing his words, a look of disappointment appeared in Wen Ya's eyes but she soon got a grip on herself. She smiled and said, "It's alright, I heard that you're engaged now, Fengnian, it must be this lady, right?" she asked, looking at Ye Li.

source: 温雅顿了顿，笑道：“凤年你工作很忙，所以可能都记不得了，不过没关系，这些美好的记忆，我记在心里就好了。”
en_us: Wen Ya paused and said smilingly, "Xu Fengnian, you're very busy with work so you might have forgotten about it but it doesn't matter, I'll remember these beautiful memories in my heart."

source: 灯光打在床上的人儿上，只见她双眼紧闭，满头大汗，仿佛正在经历什么难以言喻的痛苦。
en_us: The light was cast on the person who was lying on the bed with her eyes closed, sweating profusely like she was experiencing some inexplicable agony.

source: 点赞甚至还没有评论多。
en_us: There were more replies than likes.

source: 然后又将那些关于支持表白的微博删了个一干二净。
en_us: She then deleted all the tweets where she confessed her love for him.

source: 然后就走了。
en_us: She left afterwards.

source: 熟知他的人都知道，但凡叶枫露出这样的笑容，那必定是有人要倒霉了。
en_us: Everyone who knew Ye Feng would know that the person whom Ye Feng smiled coldly at would definitely be in trouble.

source: 爸爸和哥哥他们绝对不会出事。
en_us: She would ensure that nothing terrible would happen to her father and brothers.

source: 爸爸您这眼神可能有点问题，不然为什么会觉得我瘦?
en_us: 'Father, there might be something wrong with your vision. Otherwise,why would you think that I'm skinny?'

source: 特别她还是被男人疼爱过的，又如何以陌生的模样同他相处。
en_us: Moreover, he used to love and pamper her. How could she treat him like a stranger again?

source: 特别是两个老人相继离世之后，他们一家的真面目就显露了出来，为了抢夺徐家家产，几乎是不顾一切代价！
en_us: In particular, after the old patriarch and matriarch passed away, the true colors of the members of the family were shown and they almost did everything they could at all costs to snatch away the family assets!

source: 特别是在灯光下，这裙子如同钻石一般，发出了耀眼的光芒。
en_us: The gown looked especially resplendent under the light as it dazzled like diamonds.

source: 特别是大提琴，他的每个艺人，都是各种才艺，样样精通。
en_us: In particular, he enjoyed the cello. All the artistes under his management were well-rounded and proficient in various instruments.

source: 特别是她那双眼睛，微微扫过任何一人，都会让人有种被电击中的感觉。
en_us: Her eyes in particular, would make everyone feel like they had been struck by an electric shock whenever she looked at them.

source: 特别是当她的微博内容都是关于于向阳的时候，骂的更凶了。
en_us: They were even harsher with their words when they realized that the content of her Twitter posts were all about Yu Xiangyang.

source: 特别是那双微微上挑的狐狸眼，像是要勾魂夺魄一般，险些将他吸了进去。
en_us: In particular, her slightly upturned foxy eyes were extremely alluring, so much that he felt like he was almost sucked into them.

source: 特别是那双眼睛，在这样一张脸上，给人一种魅惑又清纯的感觉。
en_us: In particular, her eyes were alluring yet pure when matched with the other features of her face.

source: 王丽看她这样，对叶漓更是厌恶。
en_us: The more she behaved that way, the more disgusted Wang Li was with Ye Li.

source: 现在十分受大品牌青眯，年纪轻轻在模特界就闯出了一片天地。
en_us: She was favored by many major brands and she had already carved out a successful career in the modeling industry at a young age.

source: 现在又怎么接受的了让她对外人下跪！
en_us: How could he accept letting her kneel down in front of an outsider!?!

source: 现在受害者是她才对好吗？
en_us: 'I'm the victim, okay?' she thought.

source: 现在可好了，怎么办？
en_us: 'Great. What do we do now?'

source: 现在叶眉故意这么说，就是暗示她哥哥们不想让她和她玩，然后自己势必又会去怪罪他们。
en_us: Now that Ye Mei had deliberately said those words, she was clearly implying that her brothers did not want to let her look for Ye Li, and assuming that Ye Li would definitely blame them again.

source: 现在想想，自己不是也走上了同样的道路吗？
en_us: After thinking about it, she realized that she had also gone on the same path.

source: 现在想想，自己可真是蠢得过分。
en_us: Now that she thought about it, she felt that she was really overly stupid.

source: 现在想起来，叶漓有些羞愧。
en_us: Ye Li was a little ashamed when she thought about it.

source: 现在看来，不是没有原因的。
en_us: 'Seems like there are reasons for that.'

source: 现在说什么都没用。
en_us: There was no point in saying anything now.

source: 现在，叶漓要用同样的方式双倍偿还。
en_us: Now, Ye Li wants to pay her back in her own coin.

source: 班级上大多同学都不是一般人，她是不敢得罪的，但是叶漓这种经常被人欺负却还没有任何还手能力的，在她看来，那就是一般人家。
en_us: Most of the students in the class were not ordinary students and she dared not offend them. However, in her opinion, Ye Li, who could not defend herself at all, was definitely from an ordinary family.

source: 班级上的人看她的眼神也从厌恶逐渐变成了羡慕。
en_us: Her classmates no longer looked at her with disdain and their disgust gradually turned into envy.

source: 甚至不少人都开始维护起来。
en_us: In fact, many of them even began to defend her.

source: 甚至于后面的大家都只听说过叶家有个千金小姐，叫做叶眉。
en_us: In fact, later one, everyone thought that the only daughter of the Ye Family was Ye Mei.

source: 甚至于每天他们系门口，都有不少的同学蹲她。
en_us: In fact there would be many students camping outside the entrance of her faculty in school everyday to wait for her.

source: 甚至在大学时期就一度抑郁。
en_us: She even developed depression at one point of her college life.

source: 甚至对她这个继妹的好超过了她那几位亲哥哥。
en_us: She even treated her stepsister better than her own brothers.

source: 甚至无法将丑这个字用在她的身上。
en_us: In fact, she could not even be described as ugly.

source: 男人声音低沉，又带着几分她从来没听到过的温柔。
en_us: His voice was deep and low with a tinge of gentleness that she had never heard before.

source: 男人带着几分低沉的声音响起。
en_us: The man said in a low voice.

source: 男人的夸赞，可没有女人口中的那么多弯弯道道。
en_us: Compliments from men were much more straightforward than that from women.

source: 男人的手迅速的压住了她不安分的手指，眼神有些警告，但更多的是无奈。
en_us: He hurriedly pressed her wandering fingers down and shot her a glance, seemingly trying to warn her but he also seemed rather helpless.

source: 男人背着光，在这样的时候出现，对女孩来说，仿佛就是天神下凡。
en_us: His back was against the light and to the girls, his appearance was like a god appearing in the mortal world.

source: 男同学的目光，也是不由自主的从叶漓的身上瞟过，就再也移不开了。
en_us: The boys couldn't help but glance at Ye Li, after which they could not take their eyes off her at all.

source: 瘦了之后，脸看起来确实要小一些了。
en_us: After losing weight, her face seemed smaller.

source: 盯着他看那么久。
en_us: 'She's staring at him for such a long time.'

source: 直到后面知道了真相，知道他是无辜的之后，才明白自己的作为有多么的可恨。
en_us: She only found out the truth later and after discovering that he was innocent, she understood how detestable her actions were.

source: 直接就将监控放了出来，并@小凤漓道歉：“十分抱歉叶小姐，这件事是我们店铺失误，当时另一位小姐拍照时，我们工作人员就曾提醒过她店铺不允许拍照，不料她竟然发上微博，给叶小姐您带来了麻烦，我们这边深感歉意，ys也会尽快联系到她，让她尽快删图并公开道歉，并会永久将这位小姐拉入ys黑名单，不在向她售卖任何产品！”
en_us: They released the footage from the surveillance cameras and apologized to Ye Li in a tweet "Miss Ye Li, we're very sorry, this matter is a result of negligence on our part. When another lady was taking a photo of herself in the dress, one of our store assistants reminded her that photography is prohibited in the store but we didn't expect her to upload it to Twitter. We are very sorry to have brought you so much trouble. YS Fashion will do our best to contact her and request her to delete the photo and make a public apology. We'll blacklist her forever and she will be unable to make any purchases from our brand in the future!"

source: 相拥而来的人们无不是西装革履，华服礼裙，盛装打扮。
en_us: The guests who arrived were all dressed to the nines in suits, traditional Chinese suits, fancy dresses and gowns.

source: 相比较叶眉这样长相单纯的女孩，叶眉给人的感觉过于强势。
en_us: In comparison to pure and simple-looking girls like Ye Mei, Ye Li seemed too domineering.

source: 相比较她的愤怒，周围的人更多的是震惊。
en_us: While she was angry, the people around her were shocked.

source: 相比较男同学们的惊讶，女同学们的注意力却在徐晗帮叶漓说话这事身上。
en_us: In contrast to the male students who were surprised, the female students were focusing their attention on the fact that Xu Han had spoken up for Ye Li.

source: 相继也有宾客离去。
en_us: Some guests had begun to leave too.

source: 看了一眼对面认真挑刺的哥哥，叶漓打开了微博。
en_us: After looking at her brother who was busy picking out the fish bones attentively, Ye Li opened the Twitter app.

source: 看了看自己的微博号，叶漓就皱起了眉头，一脸嫌恶。
en_us: Ye Li frowned in disgust when she looked at her Twitter account.

source: 看似一副维护姐妹，情深意切的模样。
en_us: She looked like she was defending her sister whom she had a close relationship with.

source: 看似温润如玉的表面，实则内里藏着一颗贪婪的内心吧！
en_us: 'A greedy heart probably lies beneath that gentle appearance!'

source: 看到他，叶明就知道，可能是自家女儿出事了。
en_us: When Ye Ming saw him, he knew that something might have happened to his daughter.

source: 看到叶漓回来，顿时就围了上去，直接就问了起来，“叶漓，你跟枫神什么关系，你真的跟他去吃饭了？”
en_us: Seeing that Ye Li had returned, they immediately stopped her and asked, "Ye Li, what's your relationship with Ye Feng? Did you really have lunch with him?"

source: 看到叶漓的瞬间她先是愣了一下，随后一脸惊喜的站了起来：“阿漓姐你醒了，还有哪里不舒服的吗？”
en_us: The moment she saw Ye Li, she was slightly stunned, after which she stood up with a look of surprise. "Sis Li, you're awake. Do you feel any discomfort?"

source: 看到她朝着自己招手，一颗心都化了，哪里还有心情想其他。
en_us: When he saw her waving at him, his heart almost melted and he was no longer in the mood to think about anything else.

source: 看到最后还站着个叶眉，大夫人着实愣了一下。
en_us: Mrs. Xu was shocked to see Ye Mei who was still standing because she didn't invite Ye Mei at all.

source: 看到真人的孟非瞪大了眼珠子，当场尖叫出声：“枫，枫神大人！”
en_us: When she saw Ye Feng in person, Meng Fei widened her eyes in shock. She screamed immediately and exclaimed, "Lord Ye Feng!"

source: 看到这一幕场景，也是呆在了原地。
en_us: When he saw that scene, he stood rooted to the ground in shock.

source: 看到这一幕的她，险些咬碎了一口银牙。
en_us: When she saw that scene she gritted her teeth so hard that she almost chipped them.

source: 看到这一幕的徐倩已经懵逼了。
en_us: Xu Qian was dumbfounded to see that scene.

source: 看到那邀请函时，不仅是侍者表情，就连叶眉的表情都变了。
en_us: At the sight of the invitation card, the steward's expression changed, and so did Ye Mei's.

source: 看吧叶漓，你上辈子是多么的愚蠢。
en_us: 'Look Ye Li, you were so silly in your previous life.'

source: 看吧，那个男人都说好看。
en_us: 'See, even that man says it looks great.'

source: 看多了骨干美女的男同学们，这会儿口水都快流出来了。
en_us: The boys who were tired of seeing skinny beauties, were almost drooling at this moment.

source: 看她脸色黯然，徐夫人才反应过来自己提到了这些伤心事，不免有些歉意，“瞧我，大好的日子说这些什么，阿漓，阿姨不是故意的，你别介意。”
en_us: Seeing her gloomy expression, Mrs. Xu finally realized that she had mentioned an unhappy event and couldn't help but feel a little apologetic. "Oh dear, why am I saying these on a joyous occasion? Ye Li, I didn't do it on purpose. Don't mind me."

source: 看她走进了试衣间，徐倩顿时就凑到了自家哥哥身边，激动的掐着他的手臂，“哥哥哥，叶家小姐啊，那不就是凤年哥哥要订婚的那个人吗？天哪，姑妈今天还说让咱们过去给咱们介绍的，没想到竟然在这里碰上了未来的大嫂子！”
en_us: Seeing that she had already entered the fitting room, Xu Qian immediately leaned closer towards her brother and pinched his arm agitatedly. "Xu Han, Xu Han, isn't the daughter of the Ye Family engaged to Xu Fengnian? Oh my God, Aunt said that she's going to introduce us to each other. I didn't expect to run into my future cousin-in-law here!"

source: 看完之后，都表示无比失望。
en_us: After seeing the photos, they were incredibly disappointed.

source: 看来这两姐妹的关系，好似也并不是表面那么好啊？
en_us: 'It seems that the relationship between these two sisters is not as good as it seems, huh?'

source: 看来这位未来的徐家少夫人，并没有表面那么简单。
en_us: She felt that Kong Yun was not as simple as she seemed to be on the surface.

source: 看来这又是一个自作多情的女人。
en_us: 'Seems like she's yet another woman who's done a lot of wishful thinking.'

source: 看清女孩子脸的瞬间，周围四处的奢华瞬间都变得黯然失色。
en_us: At the instant that he saw her face, all the luxurious decor in the background around him seemed to have lost their luster.

source: 看清是谁之后，叶漓也是愣了一下。
en_us: Ye Li was shocked after seeing who he was.

source: 看看这关心的表情，要不是已经经历过一辈子，叶漓估摸要感动。
en_us: If Ye Li hadn't had the experience of her previous life, she would have probably been touched by how concerned Ye Mei appeared to be.

source: 看着下面越演越烈的声音，叶眉满意的关了手机，准备回家练习小提琴。
en_us: Seeing that the discussion was getting more and more heated and intense, Ye Mei switched off her mobile phone in satisfaction and got ready to go home to practice the violin.

source: 看着叶漓如同公主一般，无论怎么嚣张跋扈，也有人惯着。
en_us: She had to watch Ye Li being arrogant and haughty because she was pampered and spoiled like a princess.

source: 看着叶漓走进教室，大家小声议论了起来。
en_us: Everyone began discussing softly when they saw Ye Li entering the classroom.

source: 看着叶漓那双魅惑的双眼，不少人都开始唾弃了起来。
en_us: Looking at Ye Li's alluring eyes, many people began to criticize her.

source: 看着怪可爱。
en_us: She found it really adorable.

source: 看着手中的红色小本本，徐凤年只感觉心里空了的一处地方，突然就满了。
en_us: Looking at the red booklet in his hand, Xu Fengnian felt that the void in his heart had been filled up.

source: 看着男人露出这样的表情，她心里就是一阵抽疼，赶忙解释道：“过段时间不是我爷爷八十大寿吗，我想到时候给他一个惊喜。”
en_us: Seeing his expression, she felt her heart twitch in pain and she hurriedly explained, "It's going to be my grandfather's 80th birthday soon. I want to give him a surprise then."

source: 看着自己亲手给喜欢的男人送的东西，却被男人送进了别的女孩嘴里，滋味不好受吧？
en_us: 'She must feel terrible seeing the man she adores, feeding another girl some fruit that she gave him, right?'

source: 看着虽然微胖，却白白嫩嫩，朝气蓬勃的女孩，大家根本就没反应过来这是叶漓。
en_us: Although she was slightly chubby, she was fair, tender, and bubbly. It took them a long while to realize that she was Ye Li.

source: 看着车消失在黑夜当中。
en_us: She watched the car disappear out of sight in the night.

source: 看着镜中圆润的自己，她微微叹了口气。
en_us: Looking at her chubby self in the mirror, she sighed a little.

source: 看着镜中如同迪士尼公主一般的自己，叶眉也是十分满足。
en_us: Resembling a Disney princess, Ye Mei was pleased to look at herself in the mirror.

source: 看着镜中焕然一新的女孩子，叶漓掏出了手机，寻了个显瘦的姿势拍了几张，翻出了某人的手机号发了过去，并配文：“新发型好看吗？”
en_us: Looking at herself in the mirror after giving herself a makeover, Ye Li took out her mobile phone and took a few photos of herself in a pose that made her look thinner. She then sent it to someone's mobile number with a text that read, "How's my new hairstyle?"

source: 看老爷子不说话，徐家的其他旁系也私下小声议论。
en_us: Seeing that the old patriarch did not speak, the other distant relatives of the Xu Family began whispering among themselves.

source: 看起来最为关心柔软的话，带来的后果却是致命。
en_us: The consequences of her gentle words of concern were fatal.

source: 真不舒服。
en_us: She was really uncomfortable.

source: 真以为所有人都宠她，所以就可以为所欲为了？？
en_us: 'Does she really think she can do whatever she wants just because everyone dotes on her?'

source: 真是呵呵！
en_us: 'Hah!'

source: 真是太傻了。
en_us: She was really too silly.

source: 真爱永恒回复枫神&向阳等于真爱：“+1，有人要去帝都大学堵人吗？”
en_us: Replying to Ye Feng and Xiangyang, Eternal True Love: "I agree. Does anyone want to camp outside Beijing University to stop her?"

source: 着实是叶漓这五官精致的让人无可挑剔。
en_us: Indeed, Ye Li's features were exquisite and flawless.

source: 着实是她这个借口太过牵强。
en_us: Her excuse was indeed a little far-fetched.

source: 瞧瞧，多么情深意切的一句话。
en_us: 'Look how sincere and genuine he seems.'

source: 瞧瞧，这就是差距。
en_us: 'See, that's the difference.'

source: 知道是一回事，但是被人提出来又是另一回事了。
en_us: Them being aware of it was one thing and someone else mentioning it was another.

source: 短短十几分钟，一个名为“讨伐小三”的讨论组迅速崛起，并瞬间收了几千的成员。
en_us: In just less than 20 minutes, a discussion group named "Confronting The Mistress" saw a surge in members by a few thousands.

source: 硬生生的去了几分美，还有些怪异。
en_us: It made her look strange and less beautiful.

source: 确实，她做到了，但是这样的她更让他恶心！
en_us: 'She has managed to catch my attention but this only makes me feel even more disgusted with her!'

source: 确实，妹妹都没有说什么，她就一直肯定的告诉大家，叶漓是因为怕他们怪罪，才不敢承认喜欢于向阳。
en_us: Actually, Ye Li never said anything much. Instead, Ye Mei was continuously telling everyone with certainty that Ye Li did not dare to admit to having feelings for Yu Xiangyang because she was afraid that they would blame her.

source: 秦柔一直营造自己居家良母的人设，更不会给女儿那么多钱，就怕大手大脚的让叶家人不喜。
en_us: For the sake of keeping up with the fake persona of a virtuous wife that she had created for herself, Qin Rou would give Ye Mei money sparingly, for fear that the latter would live lavishly and end up causing the Ye Family to dislike her.

source: 秦柔听说是回娘家了不知道是去干什么。
en_us: She heard that Qin Rou had returned to her family's home for some reason.

source: 秦柔大惊：“你这孩子，说什么傻话，我带你离开这里，还能去哪里呀！”
en_us: Qin Rou exclaimed in shock, "Why are you saying such silly things? Where can I take you away to?"

source: 秦柔心中一惊，总感觉刚刚叶漓露出的笑容很是恐怖，让她心中发凉，可再次看去时，却发现她的表情如常，刚刚那抹笑好似从未在她脸上露出一般。
en_us: Qin Rou was astonished and she felt that Ye Li's smile was extremely terrifying. It even made her feel a cold chill in her heart. However, when she looked again, she found that Ye Li's expression was as per normal and it was as if that smirk never appeared on her face just now.

source: 秦柔看到的时候，还有些惊讶，听女儿这么一说，顿时就想起来了。
en_us: Qin Rou was a little surprised when she saw the invitation card and after hearing her daughter's words, she immediately thought about it.

source: 秦柔脸色有些尴尬：“这事你别问，安心等着就行，我自有分寸。”
en_us: With an awkward expression, Qin Rou said, "Don't ask about it. Just wait patiently. I know what to do."

source: 秦柔闻言，脸色顿变：“他们欺负你？”
en_us: Upon hearing her words, Qin Rou's expression turned sullen immediately. "They bullied you?"

source: 秦柔阴沉了脸：“都怪妈妈，让你受委屈了，再等等，等妈妈给你生个弟弟，我有了儿子，我看她还如何敢欺负我们母子！”
en_us: With a sullen expression, Qin Rou said, "It's all my fault that you got mistreated. Just wait a little longer. Wait for me to give birth to a baby boy. Once I have a son, I shall see if she has the audacity to bully us!"

source: 积攒了一天的愤怒，在此刻彻底爆发。
en_us: At this moment, she flew into a rage and all the anger that had been brewing within her throughout the day, erupted.

source: 程艳将叶漓带了进来，孟非就瞪了眼，伸手指向了她：“爸爸，妈妈，就是她弄伤我的，你们一定要给我报仇啊！”
en_us: Cheng Yan brought Ye Li in and as soon as Meng Fei entered, she glowered at the latter and pointed at her. "Father, Mother, she was the one who hurt me. You must take revenge for me!"

source: 程艳心里本来就憋了一股子火，这会儿听她竟然还敢还嘴，顿时暴怒，一拍桌站了起来：“你还不得了了是不，竟然敢反驳老师的话，我看你就是有人养没人教的，长辈说话，什么时候轮到你这个小辈教训！”
en_us: Cheng Yan was initially already boiling with fury. After hearing Ye Li's rebuttal, she immediately flew into a rage and smacked the table as she stood up. "You're impressive, eh? How dare you talk back to your teacher? You don't have any manners at all. Who are you to lecture me, your elder!?!"

source: 程艳想到叶漓接下来的下场，心里积攒的郁气终于消散了不少。
en_us: At the thought of the outcome that Ye Li would face, Cheng Yan finally felt less depressed.

source: 程艳愣了一下，随后黑了脸。
en_us: After being stunned for a while, Cheng Yan's face turned sullen.

source: 程艳气的浑身颤抖。
en_us: Cheng Yan's body trembled in anger.

source: 程艳气的要死，偏偏对方还是她根本不敢说的。
en_us: Cheng Yan was extremely infuriated but she dared not offend Xu Han.

source: 程艳现在的心情估计更差吧？
en_us: 'Cheng Yan probably feels worse now, right?'

source: 程艳的脸色很是难看，这会儿杀了叶漓的心都有了。
en_us: Cheng Yan's face was extremely sullen and she even had an urge to kill Ye Li.

source: 程艳看了一会，就阴沉着脸道：“叶漓，你站起来。”
en_us: Cheng Yan looked at it for a while before saying with a sullen expression, "Ye Li, stand up."

source: 程艳站出来冷哼道：“这件事全班的人都看见了，你还想狡辩，而且你伤她是真，再加上毁坏学校名誉，退学已经算是最轻的处罚了，你别给脸不要脸！”
en_us: Cheng Yan stepped out and said coldly, "Everyone in class saw what happened. Yet, you still want to argue. Besides, it's true that you hurt her. Besides, she has ruined the school's reputation and expulsion is considered a light punishment. Don't push your limits!"

source: 程艳站在一边，已经被这个消息彻底惊在了原地。
en_us: Shocked out of her senses by the piece of news, Cheng Yan stood rooted to the ground at the side.

source: 程艳脸色阴沉了下去，气恼上头的她并没有在意叶漓那一句“你怕是不知道这是谁的地盘”的话。
en_us: Cheng Yan's face grew sullen and being overwhelmed with anger, she didn't pay attention to one of the things Cheng Yan said— "You probably don't know whose turf this is."

source: 程艳说的那些事他也知道，毕竟叶枫是他们学校出了名的大红人，谁料今天竟然和学校的女学生闹出了这种事，现在贴吧都爆炸了，他肯定是被惊动的。
en_us: He knew about the matters that Cheng Yan had mentioned. After all, Ye Feng was a famous figure in school but he did not expect him to be involved in such an incident with a female classmate. Word about it had spread like wildfire and caused a huge uproar. He was definitely alarmed.

source: 程艳阴沉道：“你知道叶枫什么身份吗？他怎么能跟常人比？不管你们干了什么，总之现在因为此而让学校受到影响，那你就得负责任！”
en_us: Cheng Yan said gloomily, "Do you know what Ye Feng's identity is? How can he be compared to ordinary people? I don't care what you've done. Anyway, you've affected the school's reputation because of this and you have to be responsible!"

source: 程艳顿时涨红了一张老脸。
en_us: Cheng Yan's face immediately became flushed.

source: 稍微有点见识的人，都知道这车上的，非富即贵。
en_us: Those who were knowledgeable enough would know that the people inside the car were extremely wealthy.

source: 穿着一身中山装，梳着一丝不苟的头发的校长坐在办公桌前，看到气势汹汹的两人，这会儿很是头疼。
en_us: The principal, who was wearing a traditional Chinese attire and had neatly combed hair was seated in front of his desk. He was getting a headache when he saw the two angst and furious people.

source: 穿着一身米白色连衣裙的叶漓从车上走下。
en_us: Ye Li, who was dressed in a white dress alighted from the car and walked out.

source: 穿着一身西装的是大哥叶洛，不过二十六岁，如今却已近叶氏集团的副总裁，下一任的叶家继承人。
en_us: Her eldest brother, Ye Luo, who was wearing a suit, had already become the Deputy CEO of the Ye Corporation even though he was only twenty-six years old. He was the next successor of the Ye Family.

source: 穿着凌乱校服的叶漓，此时正一脸狠色的骑在一女孩身上，一个又一个的巴掌扇在那身下的女生身上。
en_us: He looked at Ye Li whose uniform was all messed up and who was straddling on top of a girl with a menacing expression and slapping her.

source: 穿着绅士西服的管家点了点头，上前几步，公事公办的态度：“几位小姐，请。”
en_us: The butler, who was dressed in a gentleman's suit, nodded and took a few steps forward. He said in a businesslike manner, "Ladies, please."

source: 突然，其中一人惊呼一声：“快看那不是咱们学校女神排名前五的叶眉吗？天哪，真的跟照片一样漂亮哎，快点拍，这可是难得的机会。”
en_us: All of a sudden, one of them exclaimed, "Look, isn't that Ye Mei, one of the top five in the goddess rankings in our school? Oh my god, she's really as beautiful as she looks in photos. Hurry and take a photo of her. This is a rare opportunity."

source: 突然，她的目光落到了闯进来的男人身上。
en_us: All of a sudden, she looked at the man who had barged in.

source: 站在原地的叶眉，气的浑身发抖。
en_us: Standing rooted to the ground, Ye Mei shivered from head to toe.

source: 竟然妄想夺得徐家财产！
en_us: She actually coveted the Xu Family's assets!

source: 竟然敢当着二夫人的面说这样的话。
en_us: 'How dare she say those words in front of Madam Kong Yun."

source: 竟然还敢跟自己呛声，不想毕业了是吗？
en_us: 'How dare she argue with me? Doesn't she want to graduate?'

source: 竟然还是徐凤年的大学同学兼同桌。
en_us: She turned out to be Xu Fengnian's former classmate in college, as well as his desk-mate.

source: 笃定了就是她抢了叶眉的新裙子，还拿出来炫耀。
en_us: They insisted that she had snatched the newly bought gown from Ye Mei and flaunted it as her own. .

source: 第二天，一条八卦新闻上了热搜。
en_us: On the second day, the gossipy news made it to the hot search.

source: 等人走了，大家才从震惊中回过了神。
en_us: Everyone finally recovered from the shock, only after the pair left.
